Aloxaf/fzf-tab
Tarrasch/zsh-bd
hlissner/zsh-autopair
greymd/docker-zsh-completion
MenkeTechnologies/zsh-expand
zsh-users/zsh-autosuggestions kind:defer
zdharma-continuum/fast-syntax-highlighting kind:defer
zsh-users/zsh-history-substring-search

